Repository: henryauthentic/weather_app_NguyenChungHieu
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Home
vi: Trang chủ

source: Hourly Forecast
vi: Dự báo theo giờ

# dailyForecast
source: 5-Day Forecast
vi: Dự báo 5 ngày

source: Weather Details
vi: Chi tiết thời tiết

source: Temperature Unit
vi: Đơn vị nhiệt độ

# tempUnitChanged
source: Temperature unit updated
vi: Đã thay đổi đơn vị nhiệt độ

source: Wind Speed Unit
vi: Đơn vị tốc độ gió

# windUnitChanged
source: Wind speed unit updated
vi: Đã thay đổi đơn vị tốc độ gió

source: Time Format
vi: Định dạng thời gian

# time24h
source: 24-hour format
vi: Định dạng 24 giờ

# time12h
source: 12-hour format
vi: Định dạng 12 giờ

source: Language
vi: Ngôn ngữ

# languageChanged
source: Language updated
vi: Đã thay đổi ngôn ngữ ứng dụng

source: App Language
vi: Ngôn ngữ ứng dụng

# useLocation
source: Use Current Location
vi: Sử dụng vị trí hiện tại

source: Auto detect location
vi: Tự động phát hiện vị trí

# automaticallyDetectLocation
source: Automatically detect your location
vi: Tự động phát hiện vị trí của bạn

source: Notifications
vi: Thông báo

source: Weather Notifications
vi: Thông báo thời tiết

source: Receive alerts
vi: Nhận cảnh báo thời tiết

source: Receive weather alerts
vi: Nhận cảnh báo thời tiết

source: Clear Cache
vi: Xóa bộ nhớ đệm

source: Cache cleared
vi: Đã xóa bộ nhớ đệm

source: Remove cached weather data
vi: Xóa dữ liệu thời tiết đã lưu

source: Clear Search History
vi: Xóa lịch sử tìm kiếm

# historyCleared
source: Search history cleared
vi: Đã xóa lịch sử tìm kiếm

source: Remove recent searches
vi: Xóa các tìm kiếm gần đây

source: About
vi: Giới thiệu

source: Version
vi: Phiên bản

source: Your weather companion
vi: Ứng dụng thời tiết của bạn

source: Units
vi: Đơn vị

source: Wind
vi: Gió

source: Humidity
vi: Độ ẩm

source: Pressure
vi: Áp suất

source: Visibility
vi: Tầm nhìn

source: Wind Speed
vi: Tốc độ gió

source: Direction
vi: Hướng

source: Cloudiness
vi: Mây

source: Sunrise
vi: Bình minh

source: Sunset
vi: Hoàng hôn

source: Location
vi: Vị trí

source: Weather Forecast
vi: Dự báo thời tiết

source: Hourly
vi: Theo giờ

source: Daily
vi: Theo ngày

# noForecastData
source: No forecast data available
vi: Không có dữ liệu dự báo

# noWeatherData
source: No weather data available
vi: Không có dữ liệu thời tiết

source: Get Weather
vi: Lấy thời tiết

source: Use Current Location
vi: Sử dụng vị trí hiện tại

source: Search City
vi: Tìm kiếm thành phố

source: Settings
vi: Cài đặt

# locationServiceDisabled
source: Location services are disabled. Please enable them in settings.
vi: Dịch vụ vị trí đang bị tắt. Vui lòng bật trong cài đặt.

source: Location permission denied.
vi: Quyền truy cập vị trí đã bị từ chối.

# locationPermissionRequired
source: Location permission is required to get weather for your location.
vi: Ứng dụng cần quyền truy cập vị trí để hoạt động.

source: Data
vi: Dữ liệu

source: Remove cache
vi: Xóa bộ nhớ đệm

source: Remove search history
vi: Xóa lịch sử tìm kiếm

source: Offline - Cached Data
vi: Ngoại tuyến - Dữ liệu đã lưu

source: Air Quality
vi: Chất lượng không khí

source: Air Quality Index
vi: Chỉ số chất lượng không khí

source: Alerts
vi: Cảnh báo

source: Weather Alerts
vi: Cảnh báo thời tiết

source: Compare
vi: So sánh

source: Compare Cities
vi: So sánh thành phố

source: Maps
vi: Bản đồ

source: Weather Maps
vi: Bản đồ thời tiết

source: Loading location data...
vi: Đang tải dữ liệu vị trí...

source: Refresh
vi: Làm mới

source: Retry
vi: Thử lại

source: OK
vi: Đồng ý

source: Cancel
vi: Hủy

source: Clear
vi: Xóa

# failedToLoadAirQuality
source: Failed to load air quality data
vi: Không thể tải dữ liệu chất lượng không khí

source: Unknown error
vi: Lỗi không xác định

source: Health Recommendation
vi: Khuyến nghị sức khỏe

# pollutantLevels
source: Pollutant Levels (μg/m³)
vi: Nồng độ chất ô nhiễm (μg/m³)

source: Main Pollutant
vi: Chất ô nhiễm chính

source: AQI Forecast
vi: Dự báo AQI

source: No Active Alerts
vi: Không có cảnh báo

# allClearNoWarnings
source: All clear! No weather warnings for your area.
vi: An toàn! Không có cảnh báo thời tiết trong khu vực của bạn.

source: Active Alerts
vi: Cảnh báo hiện tại

source: Upcoming Alerts
vi: Cảnh báo sắp tới

source: ACTIVE
vi: ĐANG HOẠT ĐỘNG

source: Time remaining
vi: Thời gian còn lại

source: Expired
vi: Đã hết hạn

source: From
vi: Từ

source: to
vi: đến

# selectAtLeast2Cities
source: Select at least 2 cities to compare
vi: Chọn ít nhất 2 thành phố để so sánh

source: Selected Cities
vi: Thành phố đã chọn

# maximum4Cities
source: Maximum 4 cities can be compared
vi: Tối đa 4 thành phố có thể được so sánh

source: Quick Overview
vi: Tổng quan nhanh

source: Detailed Comparison
vi: So sánh chi tiết

source: Temperature
vi: Nhiệt độ

source: Feels Like
vi: Cảm giác như

source: Failed to load
vi: Không thể tải

source: Enter city name...
vi: Nhập tên thành phố...

source: Favorite Cities
vi: Thành phố yêu thích

source: Recent Searches
vi: Tìm kiếm gần đây

source: Popular Cities
vi: Thành phố phổ biến

# maximum5FavoriteCities
source: Maximum 5 favorite cities allowed
vi: Tối đa 5 thành phố yêu thích

source: Cloud Coverage
vi: Độ che phủ mây

source: Precipitation
vi: Lượng mưa

source: Overlay Opacity
vi: Độ mờ lớp phủ

# windEffect
source: Wind
vi: Gió

source: Temperature Glow
vi: Hiệu ứng nhiệt độ

source: Rain Effect
vi: Hiệu ứng mưa

source: Heavy
vi: Nặng

source: Moderate
vi: Vừa phải

source: Light
vi: Nhẹ

source: Cloud layers
vi: Lớp mây

# condition
source: Cond
vi: Điều kiện
